ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
            <register>
              <name>PROGVERSION2</name>
              <description>FT2 test program version.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>PROGVERSION2</name>
                  <description>FT2 test program version</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <cluster>
            <name>SYSCTRL</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <name>FLL16M</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_FLL16M</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_FLL16M_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>RCOARSE</name>
                  <description>Trim value for SYSCTRL.FLL16M.RCOARSE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RFINE</name>
                  <description>Trim value for SYSCTRL.FLL16M.RFINE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for SYSCTRL.FLL16M.TCOEF</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SYSCTRL.FLL16M.VSUP</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>CKSW16MTRIM</name>
                  <description>Trim value for SYSCTRL.FLL16M.CKSW16MTRIM</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFRC</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFRC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x14</addressOffset>
              <cluster>
                <name>CAL</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFRC_CAL</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>LFRCOSCTRIM</name>
                  <description>Trim value for SYSCTRL.LFRC.LFRCOSCTRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFXO</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFXO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x18</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFXO_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>PDLOWERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.PDLOWERTHR</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PDUPPERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.PDUPPERTHR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.LFXO.BIAS</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PIXO</name>
                  <description>Trim value for SYSCTRL.LFXO.PIXO</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIMBUS</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIMBUS</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HFXO64M</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_HFXO64M</headerStructName>
              <access>read-write</access>
              <addressOffset>0x2C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_HFXO64M_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>DOUBLERCOMP</name>
                  <description>Trim value for SYSCTRL.HFXO64M.TRIM.DOUBLERCOMP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>CHIRPTUNE</name>
                  <description>Trim value for SYSCTRL.HFXO64M.TRIM.CHIRPTUNE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RTUNE</name>
                  <description>Trim value for SYSCTRL.HFXO64M.TRIM.RTUNE</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFLPRC</name>
              <description>Unspecified</description>
              <headerStructName>LFLPRC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for SYSCTRL.LFLPRC.VSUP</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCOARSE</name>
                <description>Trim value for SYSCTRL.LFLPRC.RCOARSE</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RFINE</name>
                <description>Trim value for SYSCTRL.LFLPRC.RFINE</description>
                <addressOffset>0x8</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>PWMFINE</name>
                <description>Trim value for SYSCTRL.LFLPRC.PWMFINE</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>VDETPOF5V0</name>
              <description>Unspecified</description>
              <headerStructName>VDETPOF5V0</headerStructName>
              <alternateCluster>LFLPRC</alternateCluster>
              <access>read-write</access>
              <addressOffset>0x48</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>VDETPOF5V0_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>PWRGOOD</name>
                  <description>Trim value for SYSCTRL.VDETPOF5V0.PWRGOOD</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VDETPOFVBAT</name>
              <description>Unspecified</description>
              <headerStructName>VDETPOFVBAT</headerStructName>
              <alternateCluster>LFLPRC</alternateCluster>
              <access>read-write</access>
              <addressOffset>0x4C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>VDETPOFVBAT_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>POFWARN</name>
                  <description>Trim value for SYSCTRL.VDETPOFVBAT.POFWARN</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>AUDIOPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_AUDIOPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x54</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for SYSCTRL.AUDIOPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>USBHSPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_USBHSPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x58</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for SYSCTRL.USBHSPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MBIAS</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS</headerStructName>
              <access>read-write</access>
              <addressOffset>0x5C</addressOffset>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CFG</name>
                  <description>Trim value for SYSCTRL.MBIAS.CFG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x4</addressOffset>
                <register>
                  <name>MBIASIBPP</name>
                  <description>Trim value for SYSCTRL.MBIAS.MBIASIBPP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>MBIASIBPSR</name>
                  <description>Trim value for SYSCTRL.MBIAS.MBIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>OSCRFR</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_OSCRFR</headerStructName>
              <access>read-write</access>
              <addressOffset>0x68</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_OSCRFR_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>OSC</name>
                  <description>Trim value for SYSCTRL.OSCRFR.OSC</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
