ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
                <register>
                  <name>TXCTRL</name>
                  <description>Trim value for RADIOCORE.RADIO.TXCTRL</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>OVRRXTRIMCODE</name>
                  <description>Trim value for RADIOCORE.RADIO.OVRRXTRIMCODE</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>RSSIOFFSET</name>
                <description>Trim value for RSSI offset compensation</description>
                <addressOffset>0x14</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>EDCAL</name>
                <description>Trim value for EDCAL</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>BOOT</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_BOOT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3E0</addressOffset>
            <cluster>
              <name>HSFLL120</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_BOOT_HSFLL120</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for SYSCTRL.HSFLL120.VSUP</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>COARSE</name>
                <description>Trim value for SYSCTRL.HSFLL120.COARSE</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FINE</name>
                <description>Trim value for SYSCTRL.HSFLL120.FINE</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>OTPC</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_BOOT_OTPC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x00C</addressOffset>
              <register>
                <name>WAITSTATES</name>
                <description>OTPC waitstates trim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>WAITSTATES</name>
                    <description>Waitstates</description>
                    <lsb>0</lsb>
                    <msb>6</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FREQUENCY</name>
                <description>OTPC frequency tim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>FREQUENCY</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>COMMON</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_COMMON</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3F8</addressOffset>
            <register>
              <name>ZERO</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=0)</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ZERO</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ONE</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ONE</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECURE</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.FINE</description>
                  <addressOffset>0x01C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HSFLL200</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x034</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL200_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL200.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.FINE</description>
                  <addressOffset>0x014</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x058</addressOffset>
              <cluster>
                <dim>7</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF200</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x074</addressOffset>
              <cluster>
                <name>BLOCKTYPE</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Trim value for SECURE.MEMCONF200.TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>WIFICORE</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_WIFICORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x500</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_WIFICORE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for WIFICORE.HSFLL.VSUP</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>COARSE</name>
                <description>Trim value for WIFICORE.HSFLL.COARSE</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FINE</name>
                <description>Trim value for WIFICORE.HSFLL.FINE</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_WIFICORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x00C</addressOffset>
              <cluster>
                <dim>23</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>REPAIR[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_WIFICORE_MEMCONF_REPAIR</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>BITLINE</name>
                  <description>Description cluster: Trim value for WIFICORE.MEMCONF.REPAIR[n].BITLINE</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_WIFICORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x05C</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for WIFICORE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>RADIO</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_WIFICORE_RADIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x078</addressOffset>
              <register>
                <name>PDADJMCS7</name>
                <description>Power detector adjustment for MCS7 for channel 7, 36, 100, 165</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>CHANNEL7</name>
                    <description>Trim value for channel 7 (units of 0.25dB)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>CHANNEL36</name>
                    <description>Trim value for channel 36 (units of 0.25dB)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>CHANNEL100</name>
                    <description>Trim value for channel 100 (units of 0.25dB)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                  <field>
                    <name>CHANNEL165</name>
                    <description>Trim value for channel 165 (units of 0.25dB)</description>
                    <lsb>24</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>PDADJMCS0</name>
                <description>Power detector adjustment for MCS0 for channel 7, 36, 100, 165</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>CHANNEL7</name>
                    <description>Trim value for channel 7 (units of 0.25dB)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>CHANNEL36</name>
                    <description>Trim value for channel 36 (units of 0.25dB)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>CHANNEL100</name>
                    <description>Trim value for channel 100 (units of 0.25dB)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                  <field>
                    <name>CHANNEL165</name>
                    <description>Trim value for channel 165 (units of 0.25dB)</description>
                    <lsb>24</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
