ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
              <register>
                <name>MAXPOW2G4</name>
                <description>Maximum output power 2GHz band, channel 7</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>DSS</name>
                    <description>Trim value for channel 7 DSS (units of 0.25dBm)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>MCS0</name>
                    <description>Trim value for channel 7 MCS0 (units of 0.25dBm)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>MCS7</name>
                    <description>Trim value for channel 7 MCS7 (units of 0.25dBm)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>MAXPOW5G0MCS7</name>
                <description>Maximum output power 5GHz band, MCS7</description>
                <addressOffset>0x00C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>CHANNEL36</name>
                    <description>Trim value for channel 36 MCS7 (units of 0.25dBm)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>CHANNEL100</name>
                    <description>Trim value for channel 100 MCS7 (units of 0.25dBm)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>CHANNEL165</name>
                    <description>Trim value for channel 165 MCS7 (units of 0.25dBm)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>MAXPOW5G0MCS0</name>
                <description>Maximum output power 5GHz band, MCS0</description>
                <addressOffset>0x010</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>CHANNEL36</name>
                    <description>Trim value for channel 36 MCS0 (units of 0.25dBm)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>CHANNEL100</name>
                    <description>Trim value for channel 100 MCS0 (units of 0.25dBm)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>CHANNEL165</name>
                    <description>Trim value for channel 165 MCS0 (units of 0.25dBm)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RXGAINOFFSET</name>
                <description>RX gain offset for channel 7, 36, 100, 165</description>
                <addressOffset>0x014</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>CHANNEL7</name>
                    <description>Trim value for channel 7 (units of 0.25dB)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>CHANNEL36</name>
                    <description>Trim value for channel 36 (units of 0.25dB)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>CHANNEL100</name>
                    <description>Trim value for channel 100 (units of 0.25dB)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                  <field>
                    <name>CHANNEL165</name>
                    <description>Trim value for channel 165 (units of 0.25dB)</description>
                    <lsb>24</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>TXPOWBACKOFFT</name>
                <description>TX power backoff versus temperature</description>
                <addressOffset>0x018</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>BAND2GHZ80C</name>
                    <description>Trim value 2.4GHz band at 80C (units of 0.25dB)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>BAND2GHZNEG20C</name>
                    <description>Trim value 2.4GHz band at -20C (units of 0.25dB)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>BAND5GHZ80C</name>
                    <description>Trim value 5GHz band at 80C (units of 0.25dB)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                  <field>
                    <name>BAND5GHZNEG20C</name>
                    <description>Trim value 5GHz band at -20C (units of 0.25dB)</description>
                    <lsb>24</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>TXPOWBACKOFFV</name>
                <description>TX power backoff versus voltage</description>
                <addressOffset>0x01C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>BAND2GHZVERYLOWV</name>
                    <description>Trim value 2.4GHz band at very low voltage (units of 0.25dB)</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>BAND2GHZLOWV</name>
                    <description>Trim value 2.4GHz band at low voltage (units of 0.25dB)</description>
                    <lsb>8</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>BAND5GHZVERYLOWV</name>
                    <description>Trim value 5GHz band at very low voltage (units of 0.25dB)</description>
                    <lsb>16</lsb>
                    <msb>23</msb>
                  </field>
                  <field>
                    <name>BAND5GHZLOWV</name>
                    <description>Trim value 5GHz band at low voltage (units of 0.25dB)</description>
                    <lsb>24</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFTRIMSPARE[%s]</name>
                <description>Description collection: Arbitrary RF register trim</description>
                <addressOffset>0x020</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value to apply</description>
                    <lsb>0</lsb>
                    <msb>7</msb>
                  </field>
                  <field>
                    <name>ADDRESS</name>
                    <description>Register address to apply trim value to. Address 0x3FFF indicates unused trim value.</description>
                    <lsb>8</lsb>
                    <msb>21</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>GRAPHICSDOMAIN</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x600</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for GRAPHICSDOMAIN.HSFLL.VSUP</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>COARSE</name>
                <description>Trim value for GRAPHICSDOMAIN.HSFLL.COARSE</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FINE</name>
                <description>Trim value for GRAPHICSDOMAIN.HSFLL.FINE</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x00C</addressOffset>
              <cluster>
                <dim>5</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for GRAPHICSDOMAIN.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>AUXPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x020</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_GRAPHICSDOMAIN_AUXPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for GRAPHICSDOMAIN.AUXPLL.CTUNE</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>BOOT</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_BOOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x8A0</addressOffset>
          <register>
            <name>SIZE</name>
            <description>Size of DATA group</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Number of trim values stored in DATA.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0xC0</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Compressed address and data pointer.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>REGOFFSET</name>
                <description>Address offset to trim register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DATAPOINTER</name>
                <description>Pointer to location in TRIM group</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SRAM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_SRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0xBB0</addressOffset>
          <register>
            <name>REPAIR0</name>
            <description>SRAM repair register 0</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0109</name>
                <description>GD RamController01 Ram 9</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0108</name>
                <description>GD RamController01 Ram 8</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0107</name>
                <description>GD RamController01 Ram 7</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0106</name>
                <description>GD RamController01 Ram 6</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR1</name>
            <description>SRAM repair register 1</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0105</name>
                <description>GD RamController01 Ram 5</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0104</name>
                <description>GD RamController01 Ram 4</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0103</name>
                <description>GD RamController01 Ram 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0102</name>
                <description>GD RamController01 Ram 2</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR2</name>
            <description>SRAM repair register 2</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0101</name>
                <description>GD RamController01 Ram 1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0111</name>
                <description>GD RamController01 Ram 11</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0110</name>
                <description>GD RamController01 Ram 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0100</name>
                <description>GD RamController01 Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR3</name>
            <description>SRAM repair register 3</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0009</name>
                <description>GD RamController00 Ram 9</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0008</name>
                <description>GD RamController00 Ram 8</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0007</name>
                <description>GD RamController00 Ram 7</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0006</name>
                <description>GD RamController00 Ram 6</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR4</name>
            <description>SRAM repair register 4</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0005</name>
                <description>GD RamController00 Ram 5</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0004</name>
                <description>GD RamController00 Ram 4</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0003</name>
                <description>GD RamController00 Ram 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0002</name>
                <description>GD RamController00 Ram 2</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR5</name>
            <description>SRAM repair register 5</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0001</name>
                <description>GD RamController00 Ram 1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0015</name>
                <description>GD RamController00 Ram 15</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0014</name>
                <description>GD RamController00 Ram 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0013</name>
                <description>GD RamController00 Ram 13</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR6</name>
            <description>SRAM repair register 6</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0012</name>
                <description>GD RamController00 Ram 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0011</name>
                <description>GD RamController00 Ram 11</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0010</name>
                <description>GD RamController00 Ram 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0000</name>
                <description>GD RamController00 Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
