ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
          <cluster>
            <name>BELLS</name>
            <description>Unspecified</description>
            <headerStructName>SPU_FEATURE_BELLS</headerStructName>
            <alternateCluster>STRUCT0</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>8</dim>
              <dimIncrement>0x0C0</dimIncrement>
              <name>PROCESSOR[%s]</name>
              <description>Unspecified</description>
              <headerStructName>SPU_FEATURE_BELLS_PROCESSOR</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>TASKS[%s]</name>
                <description>Description collection: Configuration of features for tasks pair [(o * 2) + 1:o * 2] of Processor ID n</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>EVENTS[%s]</name>
                <description>Description collection: Configuration of features for events pair [(o * 2) + 1:o * 2] of Processor ID n</description>
                <addressOffset>0x040</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>INTEN[%s]</name>
                <description>Description collection: Configuration of features for INTEN register pair [(o * 2) + 1:o * 2] of Processor ID n</description>
                <addressOffset>0x080</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
