ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
          <register>
            <name>MWCR</name>
            <description>This register controls the direction of the data word for the half-duplex Microwire serial protocol.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MWMOD</name>
                <description>Microwire Transfer Mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NON_SEQUENTIAL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEQUENTIAL</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MDD</name>
                <description>Microwire Control.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RECEIVE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRANSMIT</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MHS</name>
                <description>Microwire Handshaking.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDMWCR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>3</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SER</name>
            <description>Serial slave select</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SER</name>
                <description>Slave Select Enable Flag.</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RSVDSER</name>
                <description>Reserved bits - read as zero</description>
                <lsb>2</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BAUDR</name>
            <description>Baudrate</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RSVDBAUDR0</name>
                <description>Reserved bits - read as zero</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SCKDV</name>
                <description>SSI Clock Divider.</description>
                <lsb>1</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RSVDBAUDR1631</name>
                <description>Reserved bits - read as zero</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXFTLR</name>
            <description>This register controls the threshold value for the transmit FIFO memory.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TFT</name>
                <description>Transmit FIFO Threshold.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RSVDTXFTLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>4</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFTHR</name>
                <description>Transfer start FIFO level.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>RSVDTXFTHR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>20</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RXFTLR</name>
            <description>This register controls the threshold value for the receive FIFO memory.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RFT</name>
                <description>Receive FIFO Threshold.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RSVDRXFTLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>4</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXFLR</name>
            <description>This register contains the number of valid data entries in the transmit FIFO memory.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXTFL</name>
                <description>Transmit FIFO Level.</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDTXFLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>5</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RXFLR</name>
            <description>This register contains the number of valid data entries in the receive FIFO memory.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXTFL</name>
                <description>Receive FIFO Level.</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDRXFLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>5</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SR</name>
            <description>Transfer Status Register</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <fields>
              <field>
                <name>BUSY</name>
                <description>SSI Busy Flag.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TFNF</name>
                <description>Transmit FIFO Not Full.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FULL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOT_FULL</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TFE</name>
                <description>Transmit FIFO Empty.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_EMPTY</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EMPTY</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RFNE</name>
                <description>Receive FIFO Not Empty.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EMPTY</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOT_EMPTY</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RFF</name>
                <description>Receive FIFO Full.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_FULL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FULL</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXE</name>
                <description>Transmission Error.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_ERROR</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TX_ERROR</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DCOL</name>
                <description>Data Collision Error.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_ERROR_CONDITION</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TX_COLLISION_ERROR</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDSR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>7</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMPLTDDF</name>
                <description>Completed Data frames</description>
                <lsb>15</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IMR</name>
            <description>Interrupt Mask Register</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000043F</resetValue>
            <fields>
              <field>
                <name>TXEIM</name>
                <description>Transmit FIFO Empty Interrupt Mask</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXOIM</name>
                <description>Transmit FIFO Overflow Interrupt Mask</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXUIM</name>
                <description>Receive FIFO Underflow Interrupt Mask</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXOIM</name>
                <description>Receive FIFO Overflow Interrupt Mask</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXFIM</name>
                <description>Receive FIFO Full Interrupt Mask</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MSTIM</name>
                <description>Multi-Master Contention Interrupt Mask. This bit field is not present if the DWC_ssi is configured as a serial-master device.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>XRXOIM</name>
                <description>XIP Receive FIFO Overflow Interrupt Mask</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXUIM</name>
                <description>Transmit FIFO Underflow Interrupt Mask</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AXIEM</name>
                <description>AXI Error Interrupt Mask</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD9IMR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPITEM</name>
                <description>SPI Transmit Error Interrupt Mask</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DONEM</name>
                <description>SSI Done Interrupt Mask</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASKED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNMASKED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1232IMR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>12</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
