ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
          <register>
            <name>DMACR</name>
            <description>DMA Control Register.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RDMAE</name>
                <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TDMAE</name>
                <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IDMAE</name>
                <description>Internal DMA Enable. This bit should be enabled only when CTRLR0.FRF = 0 (Motorola SPI) and CTRLR0.SPI_FRF FIXME GT 0.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ATW</name>
                <description>AXI transfer width for DMA transfers mapped to arsize/awsize. This value must be less than or equal to SSIC_AXI_DW.   Values:</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDDMACR5</name>
                <description>Reserved bits - read as zero</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AINC</name>
                <description>Address Increment. Indicates whether to increment the AXI address on every transfer.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDDMACR7</name>
                <description>Reserved bits - read as zero</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACACHE</name>
                <description>AXI arcache/awcache signal value.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>APROT</name>
                <description>AXI arprot/awprot signal value.</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AID</name>
                <description>AXI awid/arid signal value.</description>
                <lsb>15</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDDMACR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>21</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DMATDLR</name>
            <description>DMA Transmit Data Level Register</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMATDL</name>
                <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RSVDDMATDLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>4</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DMARDLR</name>
            <description>DMA Receive Data Level Register</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMARDL</name>
                <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RSVDDMARDLR</name>
                <description>Reserved bits - read as zero</description>
                <lsb>4</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IDR</name>
            <description>This register contains the peripherals identification code, which is written into the register at configuration time using coreConsultant.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x51535049</resetValue>
            <fields>
              <field>
                <name>IDCODE</name>
                <description>Identification code. The register contains the peripherals identification code, which is written into the register at configuration time using CoreConsultant.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SSICVERSIONID</name>
            <description>This read-only register stores the specific DWC_ssi component version.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x3130332A</resetValue>
            <fields>
              <field>
                <name>SSICCOMPVERSION</name>
                <description>Contains the hex representation of the Synopsys component version. Consists of ASCII value for each number in the version, followed by *. For example 31_30_33_2A represents the version 1.03*.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x24</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DR0[%s]</name>
            <description>Description collection: Data register [n]</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DR</name>
                <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXSAMPLEDELAY</name>
            <description>Receive Data sample delay</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RSD</name>
                <description>Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RSVD0RXSAMPLEDLY</name>
                <description>Reserved bits - read as zero</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SE</name>
                <description>Receive Data (rxd) Sampling Edge. This register is used to decide the sampling edge for RXD signal with ssi_clk. Then this bit is set to 1 then negative edge of ssi_clk will be used to sample the incoming data, otherwise positive edge will be used for sampling.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>RSVD1RXSAMPLEDLY</name>
                <description>Reserved bits - read as zero</description>
                <lsb>17</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPICTRLR0</name>
            <description>SPI Control Register 0</description>
            <addressOffset>0x0F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000200</resetValue>
            <fields>
              <field>
                <name>TRANSTYPE</name>
                <description>Address and instruction transfer format.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TT0</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TT1</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TT2</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TT3</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADDRL</name>
                <description>This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the FIFO the transfer can begin.</description>
                <lsb>2</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ADDR_L0</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L12</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L16</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L20</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L24</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L28</name>
                    <description>Unspecified</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L32</name>
                    <description>Unspecified</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L36</name>
                    <description>Unspecified</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L40</name>
                    <description>Unspecified</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L44</name>
                    <description>Unspecified</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L48</name>
                    <description>Unspecified</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L52</name>
                    <description>Unspecified</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L56</name>
                    <description>Unspecified</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDR_L60</name>
                    <description>Unspecified</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDSPICTRLR06</name>
                <description>Reserved bits - read as zero</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>XIPMDBITEN</name>
                <description>Mode bits enable in XIP mode. If this bit is set to 1, then in XIP mode of operation DWC_ssi will insert mode bits after the address phase. These bits are set in register XIP_MODE_BITS register. The length of mode bits is always set to 8 bits.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INSTL</name>
                <description>Dual/Quad/Octal mode instruction length in bits.</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INST_L0</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INST_L4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INST_L8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INST_L16</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDSPICTRLR010</name>
                <description>Reserved bits - read as zero</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>WAITCYCLES</name>
                <description>Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. Specified as number of SPI clock cycles.</description>
                <lsb>11</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SPIDDREN</name>
                <description>SPI DDR Enable bit. This will enable Dual-data rate transfers in Dual/Quad/Octal frame formats of SPI.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INSTDDREN</name>
                <description>Instruction DDR Enable bit. This will enable Dual-data rate transfer for Instruction phase.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPIRXDSEN</name>
                <description>Read data strobe enable bit. Once this bit is set to 1 DWC_ssi will use Read data strobe (rxds) to capture read data in DDR mode.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>XIPDFSHC</name>
                <description>Fix DFS for XIP transfers. If this bit is set to 1 then data frame size for XIP transfers will be fixed to the programmed value in CTRLR0.DFS. The number of data frames to fetch will be determined by HSIZE and HBURST signals. If this bit is set to 0 then data frame size and number of data frames to fetch will be determined by HSIZE and HBURST signals</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>XIPINSTEN</name>
                <description>XIP instruction enable bit. If this bit is set to 1 then XIP transfers will also have instruction phase. The instruction op-codes will be chosen from XIP_INCR_INST or XIP_WRAP_INST registers bases on AHB transfer type.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SSICXIPCONTXFEREN</name>
                <description>Enable continuous transfer in XIP mode. If this bit is set to 1 then continuous transfer mode in XIP will be enabled, in this mode DWC_ssi will keep slave selected until a non-XIP transfer is detected on the AHB interface.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDSPICTRLR02223</name>
                <description>Reserved bits - read as zero</description>
                <lsb>22</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPIDMEN</name>
                <description>SPI data mask enable bit.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SPIRXDSSIGEN</name>
                <description>Enable rxds signaling during address and command phase of Hypebus transfer.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>XIPMBL</name>
                <description>XIP Mode bits length. Sets the length of mode bits in XIP mode of operation. These bits are valid only when SPI_CTRLR0.XIP_MD_BIT_EN is set to 1.</description>
                <lsb>26</lsb>
                <msb>27</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MBL_2</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MBL_4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MBL_8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MBL_16</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVDSPICTRLR028</name>
                <description>Reserved bits - read as zero</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>XIPPREFETCHEN</name>
                <description>Enables XIP pre-fetch functionality in DWC_ssi.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKSTRETCHEN</name>
                <description>Enables clock stretching capability in SPI transfers.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>RSVDSPICTRLR0</name>
                <description>Reserved bits - read as zero</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
