ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
          <register>
            <name>SPICTRLR1</name>
            <description>SPI Control Register 1</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DYNWS</name>
                <description>SPI Dynamic Wait states field.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>RSVDSPICTRLR137</name>
                <description>Reserved bits - Read Only</description>
                <lsb>3</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAXWS</name>
                <description>Maximum wait cycles allowed per transaction.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>RSVDSPICTRLR11232</name>
                <description>Reserved bits - Read Only</description>
                <lsb>12</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SPITECR</name>
            <description>SPI Transmit Error Interrupt Clear Register</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SPITECR</name>
                <description>Clear SPI Transmit Error interrupt.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVDSPITECR</name>
                <description>Reserved bits - Read Only</description>
                <lsb>1</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QSPI110_NS">
      <name>GLOBAL_QSPI110_S</name>
      <description>Quad serial peripheral interface 1</description>
      <baseAddress>0x5F0A3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QSPI110</name>
        <value>163</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QSPI110_NS">
      <name>GLOBAL_QSPI111_NS</name>
      <description>Quad serial peripheral interface 2</description>
      <baseAddress>0x4F0A5000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QSPI111</name>
        <value>165</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QSPI110_NS">
      <name>GLOBAL_QSPI111_S</name>
      <description>Quad serial peripheral interface 3</description>
      <baseAddress>0x5F0A5000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QSPI111</name>
        <value>165</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_DPPIC110_NS</name>
      <description>Distributed programmable peripheral interconnect controller 0</description>
      <baseAddress>0x4F0A6000</baseAddress>
      <headerStructName>DPPIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DPPIC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TASKS_CHG[%s]</name>
          <description>Channel group tasks</description>
          <headerStructName>DPPIC_TASKS_CHG</headerStructName>
          <access>write-only</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Enable channel group n</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Disable channel group n</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DIS</name>
                <description>Disable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SUBSCRIBE_CHG[%s]</name>
          <description>Subscribe configuration for tasks</description>
          <headerStructName>DPPIC_SUBSCRIBE_CHG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x080</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].EN</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>DPPI channel that task CHG[n].EN will subscribe to</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].DIS</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>DPPI channel that task CHG[n].DIS will subscribe to</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
