ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_14_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [14]</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_14_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [14]</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_15_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [15]</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_15_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [15]</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCCONF[%s]</name>
          <description>Description collection: Configuration of coexistence client [n]</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Coexistence mode of the client [m]</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>Priority of the coexistence client [n]</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TURNAROUND[%s]</name>
          <description>Description collection: Turnaround time for the coexistence client [n]</description>
          <addressOffset>0x640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000280</resetValue>
          <fields>
            <field>
              <name>CLOCKCYCLES</name>
              <description>Number of clock cycles</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GRANTED</name>
          <description>Granted status of the shared resource</description>
          <addressOffset>0x700</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLIENT_0</name>
              <description>Granted status coexistence client [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_1</name>
              <description>Granted status coexistence client [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [1]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [1]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_2</name>
              <description>Granted status coexistence client [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [2]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [2]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_3</name>
              <description>Granted status coexistence client [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [3]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [3]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_4</name>
              <description>Granted status coexistence client [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [4]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [4]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_5</name>
              <description>Granted status coexistence client [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [5]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [5]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_6</name>
              <description>Granted status coexistence client [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [6]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [6]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_7</name>
              <description>Granted status coexistence client [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [7]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [7]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_8</name>
              <description>Granted status coexistence client [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [8]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [8]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_9</name>
              <description>Granted status coexistence client [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [9]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [9]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_10</name>
              <description>Granted status coexistence client [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [10]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [10]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_11</name>
              <description>Granted status coexistence client [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [11]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [11]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_12</name>
              <description>Granted status coexistence client [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [12]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [12]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_13</name>
              <description>Granted status coexistence client [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [13]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [13]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_14</name>
              <description>Granted status coexistence client [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [14]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [14]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLIENT_15</name>
              <description>Granted status coexistence client [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGranted</name>
                  <description>Shared resource is not granted for coexistence client [15]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Granted</name>
                  <description>Shared resource is granted for coexistence client [15]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PCGCSLAVE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_COEXC_PCGCSLAVE</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
