ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_COEXC_NS">
      <name>GLOBAL_COEXC_S</name>
      <description>Coexistence controller 1</description>
      <baseAddress>0x5F8E8000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_ANTSWC_NS</name>
      <description>Antenna switch controller 0</description>
      <baseAddress>0x4F8E9000</baseAddress>
      <headerStructName>ANTSWC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ANTSWC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>EVENTS_TXERROR</name>
          <description>Event indicating that a concurrent TX error condition has occurred</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_TXERROR</name>
              <description>Event indicating that a concurrent TX error condition has occurred</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_TXRXERROR</name>
          <description>Event indicating that a concurrent TX-RX error condition has occurred</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_TXRXERROR</name>
              <description>Event indicating that a concurrent TX-RX error condition has occurred</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ANTSWCHANGED</name>
          <description>Event indicating that the AntSw signal has changed</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_ANTSWCHANGED</name>
              <description>Event indicating that the AntSw signal has changed</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LNASWCHANGED</name>
          <description>Event indicating that the LnaSw signal has changed</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_LNASWCHANGED</name>
              <description>Event indicating that the LnaSw signal has changed</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TXERROR</name>
          <description>Publish configuration for event TXERROR</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event TXERROR will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_TXRXERROR</name>
          <description>Publish configuration for event TXRXERROR</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event TXRXERROR will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_ANTSWCHANGED</name>
          <description>Publish configuration for event ANTSWCHANGED</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event ANTSWCHANGED will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_LNASWCHANGED</name>
          <description>Publish configuration for event LNASWCHANGED</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event LNASWCHANGED will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>ERRORSTATUS</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_ANTSWC_ERRORSTATUS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>TX</name>
            <description>Concurrent TX error condition</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Count of concurrent TX error conditions detected</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRORACTIVE</name>
                <description>Concurrent TX error condition is active</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXRX</name>
            <description>Concurrent TX-RX error condition</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Count of concurrent TX-RX error conditions detected</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRORACTIVE</name>
                <description>Concurrent TX-RX error condition is active</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORPORT</name>
            <description>Indicates which ports are in error</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ERRORPORT</name>
                <description>Bitfield indicating the ports in error during the last error condition.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CONFIG</name>
          <description>Antenna switch controller enable / software reset</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEPKTACTIVE_0</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_1</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_2</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_3</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_4</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_5</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_6</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_7</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable antenna switch module.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Antenna Switch Controller disabled - all outputs held low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Antenna Switch Controller enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
