ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
        <register>
          <name>RESETMASK</name>
          <description>Mask the reset request for a domain by itself.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>DOMAIN_0</name>
              <description>Mask the reset request for the domain[0], where [0] is domain id.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_1</name>
              <description>Mask the reset request for the domain[1], where [1] is domain id.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_2</name>
              <description>Mask the reset request for the domain[2], where [2] is domain id.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_3</name>
              <description>Mask the reset request for the domain[3], where [3] is domain id.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_4</name>
              <description>Mask the reset request for the domain[4], where [4] is domain id.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_5</name>
              <description>Mask the reset request for the domain[5], where [5] is domain id.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_6</name>
              <description>Mask the reset request for the domain[6], where [6] is domain id.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_7</name>
              <description>Mask the reset request for the domain[7], where [7] is domain id.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_8</name>
              <description>Mask the reset request for the domain[8], where [8] is domain id.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_9</name>
              <description>Mask the reset request for the domain[9], where [9] is domain id.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_10</name>
              <description>Mask the reset request for the domain[10], where [10] is domain id.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_11</name>
              <description>Mask the reset request for the domain[11], where [11] is domain id.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_12</name>
              <description>Mask the reset request for the domain[12], where [12] is domain id.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_13</name>
              <description>Mask the reset request for the domain[13], where [13] is domain id.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_14</name>
              <description>Mask the reset request for the domain[14], where [14] is domain id.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_15</name>
              <description>Mask the reset request for the domain[15], where [15] is domain id.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mask</name>
                  <description>Mask the reset request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unmask</name>
                  <description>Unmask the reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
