ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STARTED</name>
              <description>Write '1' to enable interrupt for event STARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to enable interrupt for event STOPPED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>END</name>
              <description>Write '1' to enable interrupt for event END</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Write '1' to enable interrupt for event OVERRUN</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STARTED</name>
              <description>Write '1' to disable interrupt for event STARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to disable interrupt for event STOPPED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>END</name>
              <description>Write '1' to disable interrupt for event END</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Write '1' to disable interrupt for event OVERRUN</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STARTED</name>
              <description>Read pending status of interrupt for event STARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Read pending status of interrupt for event STOPPED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>END</name>
              <description>Read pending status of interrupt for event END</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Read pending status of interrupt for event OVERRUN</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>PDM module enable register</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable PDM module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMCLKCTRL</name>
          <description>PDM clock generator control</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x08400000</resetValue>
          <fields>
            <field>
              <name>FREQ</name>
              <description>PDM_CLK frequency configuration. Enumerations are deprecated, use
        PDMCLKCTRL equation to find the register value. The 12 least significant bits of the
        register are ignored and shall be set to zero.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1000K</name>
                  <description>PDM_CLK = 32 MHz / 32 = 1.000 MHz</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Default</name>
                  <description>PDM_CLK = 32 MHz / 31 = 1.032 MHz. Nominal clock for RATIO=Ratio64. Assumes a 20 bit Baud Rate Generator (BRG) dividing the 32 MHz clock. Output of BRG is connected to PDM_CLK, the filter source clock requires twice that rate, a frequency doubler is built in the module to provide 2.048 MHz, which implies a filter clockdiv ratio hardcoded at x2 to the IP.</description>
                  <value>0x08400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1067K</name>
                  <description>PDM_CLK = 32 MHz / 30 = 1.067 MHz</description>
                  <value>0x08800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1231K</name>
                  <description>PDM_CLK = 32 MHz / 26 = 1.231 MHz</description>
                  <value>0x09800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1280K</name>
                  <description>PDM_CLK = 32 MHz / 25 = 1.280 MHz. Nominal clock for RATIO=Ratio80.</description>
                  <value>0x0A000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1333K</name>
                  <description>PDM_CLK = 32 MHz / 24 = 1.333 MHz</description>
                  <value>0x0A800000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Defines the routing of the connected PDM microphones' signals</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPERATION</name>
              <description>Mono or stereo operation Mono also disables the gated clock to the right filter bank</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stereo</name>
                  <description>Sample and store one pair (left + right) of 16-bit samples per RAM word R=[31:16]; L=[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mono</name>
                  <description>Sample and store two successive left samples (16 bits each) per RAM word L1=[31:16]; L0=[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Defines on which PDM_CLK edge left (or mono) is sampled</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LeftFalling</name>
                  <description>Left (or mono) is sampled on falling edge of PDM_CLK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LeftRising</name>
                  <description>Left (or mono) is sampled on rising edge of PDM_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDBYPASS</name>
          <description>Bypass the frequency doubler in the PDM clock generation</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Bypass the frequency doubler in the PDM clock generation, and revert to a simple divider structure.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoublerActive</name>
                  <description>PDMCLKCTRL determines directly the PDM_CLK frequency. A doubler is used to provide twice that clock to the filters. This allows better accuracy on PDM_CLK.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DividerActive</name>
                  <description>PDMCLKCTRL determines the clock provided to the filters, PDM_CLK is generated by dividing that clock by two. This results in less accuracy on PDM_CLK.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLDATA</name>
          <description>Left sample from filter output</description>
          <addressOffset>0x510</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDLDATA</name>
              <description>Left sample from filter output</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDRDATA</name>
          <description>Right sample from filter output</description>
          <addressOffset>0x514</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDRDATA</name>
              <description>Right sample from filter output</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINL</name>
          <description>Left output gain adjustment</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>GAINL</name>
              <description>Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters) 0x00    -20 dB gain adjust 0x01  -19.5 dB gain adjust (...) 0x27   -0.5 dB gain adjust 0x28      0 dB gain adjust 0x29   +0.5 dB gain adjust (...) 0x4F  +19.5 dB gain adjust 0x50    +20 dB gain adjust 0x51    +20 dB gain adjust 0x52    +20 dB gain adjust (...)</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20 dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0 dB gain adjustment</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20 dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINR</name>
          <description>Right output gain adjustment</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>GAINR</name>
              <description>Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20 dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0 dB gain adjustment</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20 dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RATIO</name>
          <description>Selects the ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly.</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>Selects the ratio between PDM_CLK and output sample rate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ratio64</name>
                  <description>Ratio of 64</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ratio80</name>
                  <description>Ratio of 80</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
