ankuns/nrfx/bsp/stable/mdk/nrf7140_graphics.svd
        <cluster>
          <name>FILTER</name>
          <description>Unspecified</description>
          <headerStructName>PDM_FILTER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x528</addressOffset>
          <register>
            <name>HPPOLE</name>
            <description>Settings for the high-pass filter</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000C</resetValue>
            <fields>
              <field>
                <name>HPPOLE</name>
                <description>Settings for the high-pass filter -3dB gain pole, assuming filter source clock of 2.048 MHz</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>p10</name>
                    <description>10 Hz</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p20</name>
                    <description>20 Hz</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p40</name>
                    <description>40 Hz</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p80</name>
                    <description>80 Hz</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p160</name>
                    <description>159 Hz</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p320</name>
                    <description>318 Hz</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p640</name>
                    <description>636 Hz</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p1k2</name>
                    <description>1271 Hz</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p2k5</name>
                    <description>2537 Hz</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p5k</name>
                    <description>5054 Hz</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p10k</name>
                    <description>10031 Hz</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p19k</name>
                    <description>19767 Hz</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p38k</name>
                    <description>38436 Hz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p73k</name>
                    <description>73037 Hz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>p134k</name>
                    <description>134010 Hz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HPDISABLE</name>
            <description>High pass filter disable</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>High pass filter disable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>High pass filter enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>High pass filter disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOFTMUTE</name>
            <description>Soft mute function</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Soft mute function</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable soft mute function</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable soft mute function</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOFTCYCLES</name>
            <description>Soft mute settings</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Soft mute settings: amount of cycles for transition</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>s16</name>
                    <description>16 filter source clock cycles</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s32</name>
                    <description>32 filter source clock cycles</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s48</name>
                    <description>48 filter source clock cycles</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s64</name>
                    <description>64 filter source clock cycles</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s80</name>
                    <description>80 filter source clock cycles</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s96</name>
                    <description>96 filter source clock cycles</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s112</name>
                    <description>112 filter source clock cycles</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>s128</name>
                    <description>128 filter source clock cycles</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLEDELAY</name>
            <description>Input Data Sampling with Number of PDM_CLK Clock Cycle Delay</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DELAY</name>
                <description>Input Data Sampling with Number of PDM_CLK Clock Cycle Delay</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>x2</name>
                    <description>2x cycles</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>x4</name>
                    <description>4x cycles</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PHASE</name>
          <description>Selection of delay on the clock line (to avoid potential setup&amp;amp;hold timing violation on input data)</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHASE</name>
              <description>To avoid potential setup&amp;amp;hold timing violation on input data, this register provides selection between 14 phase delay registers (15 taps), which each provide an additional 31.25ns delay of pdmClockToPad relative to pdmClockToFilter.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>PDM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>CLK</name>
            <description>Pin number configuration for PDM CLK signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIN</name>
            <description>Pin number configuration for PDM DIN signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RAMCONFIG</name>
          <description>Trim value for internal PDM RAM</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>WM</name>
              <description>Write Margin Adjustment</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RWM</name>
              <description>Read/Write Margin Adjustment</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>RM</name>
              <description>Read Margin Adjustment</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BTRIM</name>
              <description>Source Bias Trim Adjustment</description>
              <lsb>3</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCONFIG</name>
          <description>Master clock generator configuration</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>Master clock source selection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK32M</name>
                  <description>32 MHz peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>Audio PLL clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JITTER</name>
              <description>Enable jittering master clock.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable jitter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable jitter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SAMPLE</name>
          <description>Unspecified</description>
          <headerStructName>PDM_SAMPLE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>PTR</name>
            <description>RAM address pointer to write samples to with EasyDMA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SAMPLEPTR</name>
                <description>Address to write PDM samples to over DMA</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Number of samples to allocate memory for in EasyDMA mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BUFFSIZE</name>
                <description>Length of DMA RAM allocation in number of samples</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of samples transferred into Data RAM since last START task</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of samples transferred into Data RAM since last START task</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>PDM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>TERMINATEONBUSERROR</name>
            <description>Terminate the transaction if a BUSERROR event is detected.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSERRORADDRESS</name>
            <description>Address of transaction that generated the last BUSERROR event.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDRESS</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
